[
  {
    "title": "What's New?",
    "subtitle": "New Hint Functionality!",
    "description": "TL;DR: New Hint Menu!",
    "updates": [
      "Now pressing the hint button opens a menu with several hint options. Try it out!"
        ],
    "fixes": [
      "No bug found to fix... Let me know if you find any."
    ],
    "comingSoon": [
      "The ability to go back and do previous Connections!",
      "Fixes to the caching."
    ],
    "version": "1.0.0.4",
    "date": "2024-12-19"
  },
  {
    "title": "What's New?",
    "subtitle": "Bug Fixes and Messaging!",
    "description": "TL;DR: Some UI fixes and added the ability to add a message after the emojis to make things easier.",
    "updates": [
      "Add a message: When you go to share/copy your results, you should now see a field where you can add text. This text will be added to the end of the message. Use it to talk about the puzzle (or gloat, if that's your thing!)"
    ],
    "fixes": [
      "Fixed a bug where categories containing many items with long names would cause the rows to run off-screen on mobile devices."
    ],
    "comingSoon": [
      "More helpful hint logic.",
      "The ability to go back and do previous Connections!",
      "Fixes to the caching."
    ],
    "version": "1.0.0.3",
    "date": "2024-06-03"
  },
  {
    "title": "What's New?",
    "subtitle": "Faster loading!",
    "description": "I've added caching in the background so that future loads won't take as long. If you play pretty regularly, you shouldn't notice a long load time anymore. Let me know if you do.<br /><br />I've also added a Define feature!",
    "updates": [
      "Define: Select a single tile and press the 'Define' button to get a dictionary definition.",
      "Added caching (I won't bore you with the techno mumbo jumbo; Enjoy your speedy load times!)"
    ],
    "fixes": [
      "None. Let me know if you find any bugs."
    ],
    "comingSoon": [
      "More helpful hint logic.",
      "The ability to go back and do previous Connections!"
    ],
    "version": "1.0.0.2",
    "date": "2024-01-24"
  },
  {
    "title": "What's New?",
    "subtitle": "Lots of updates!",
    "description": "Thanks for playing! Since there are lots of updates, I thought I'd start keeping track. Every time I make a significant change, I will release a document like this with a brief explination of the updates (aka: Patch Notes). Without further adieu, here are the changes!",
    "updates": [
      "Updated confetti! 🎉🎊🥳",
      "Added more emojis for when you use hints, and when you get the purple group on your first guess!! 🧠🧐",
      "Oh! and... added patch notes of course! If you want to see them again, you can find a <span class=\"mdi mdi-note-text-outline\"></span> button on top of the screen."
    ],
    "fixes": [
      "Fixed a bug where long category names would cause the row to run off the screen.",
      "Cleaned up some of the UI elements.",
      "Other minor bug fixes."
    ],
    "comingSoon": [
      "The ability to go back and do previous Connections!"
    ],
    "version": "1.0.0.1",
    "date": "2024-02-29"
  }
]